IDEA StatiCa Open Model
OpenModel.ArcSegment3D Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 List of ArcSegment3D
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ArcSegment3D> ArcSegment3D { get; set; }
Public Property ArcSegment3D As List(Of ArcSegment3D)
	Get
	Set
public:
property List<ArcSegment3D^>^ ArcSegment3D {
	List<ArcSegment3D^>^ get ();
	void set (List<ArcSegment3D^>^ value);
}
Property Value
Type: List<ArcSegment3D>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace